grevaillot/svd_tools/headers/STM32H7x7_CM4/gpioc.h
#pragma once 

/* --- GPIOC: GPIO -------------------------------------------------- */

/** @defgroup gpioc_registers GPIO Register
@{*/

/** GPIOC_GPIO_MODER GPIO port mode register **/
#define GPIOC_GPIO_MODER			MMIO32(GPIOC_BASE + 0x00)
/** GPIOC_GPIO_OTYPER GPIO port output type register **/
#define GPIOC_GPIO_OTYPER			MMIO32(GPIOC_BASE + 0x04)
/** GPIOC_GPIO_OSPEEDR GPIO port output speed register **/
#define GPIOC_GPIO_OSPEEDR			MMIO32(GPIOC_BASE + 0x08)
/** GPIOC_GPIO_PUPDR GPIO port pull-up/pull-down register **/
#define GPIOC_GPIO_PUPDR			MMIO32(GPIOC_BASE + 0x0c)
/** GPIOC_GPIO_IDR GPIO port input data register **/
#define GPIOC_GPIO_IDR			MMIO32(GPIOC_BASE + 0x10)
/** GPIOC_GPIO_ODR GPIO port output data register **/
#define GPIOC_GPIO_ODR			MMIO32(GPIOC_BASE + 0x14)
/** GPIOC_GPIO_BSRR GPIO port bit set/reset register **/
#define GPIOC_GPIO_BSRR			MMIO32(GPIOC_BASE + 0x18)
/** GPIOC_GPIO_LCKR This register is used to lock the configuration of the port bits when a correct write sequence is applied to bit 16 (LCKK). The value of bits [15:0] is used to lock the configuration of the GPIO. During the write sequence, the value of LCKR[15:0] must not change. When the LOCK sequence has been applied on a port bit, the value of this port bit can no longer be modified until the next MCU reset or peripheral reset.A specific write sequence is used to write to the GPIOx_LCKR register. Only word access (32-bit long) is allowed during this locking sequence.Each lock bit freezes a specific configuration register (control and alternate function registers). **/
#define GPIOC_GPIO_LCKR			MMIO32(GPIOC_BASE + 0x1c)
/** GPIOC_GPIO_AFRL GPIO alternate function low register **/
#define GPIOC_GPIO_AFRL			MMIO32(GPIOC_BASE + 0x20)
/** GPIOC_GPIO_AFRH GPIO alternate function high register **/
#define GPIOC_GPIO_AFRH			MMIO32(GPIOC_BASE + 0x24)

/**@}*/


/** @defgroup gpioc_gpio_moder GPIOMODER GPIO port mode register
@{*/


#define GPIOC_GPIO_MODER_MODER15_SHIFT		30
#define GPIOC_GPIO_MODER_MODER15_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder15 MODER15 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOC_GPIO_MODER_MODER14_SHIFT		28
#define GPIOC_GPIO_MODER_MODER14_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder14 MODER14 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOC_GPIO_MODER_MODER13_SHIFT		26
#define GPIOC_GPIO_MODER_MODER13_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder13 MODER13 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOC_GPIO_MODER_MODER12_SHIFT		24
#define GPIOC_GPIO_MODER_MODER12_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder12 MODER12 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOC_GPIO_MODER_MODER11_SHIFT		22
#define GPIOC_GPIO_MODER_MODER11_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder11 MODER11 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOC_GPIO_MODER_MODER10_SHIFT		20
#define GPIOC_GPIO_MODER_MODER10_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder10 MODER10 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOC_GPIO_MODER_MODER9_SHIFT		18
#define GPIOC_GPIO_MODER_MODER9_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder9 MODER9 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOC_GPIO_MODER_MODER8_SHIFT		16
#define GPIOC_GPIO_MODER_MODER8_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder8 MODER8 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOC_GPIO_MODER_MODER7_SHIFT		14
#define GPIOC_GPIO_MODER_MODER7_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder7 MODER7 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOC_GPIO_MODER_MODER6_SHIFT		12
#define GPIOC_GPIO_MODER_MODER6_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder6 MODER6 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOC_GPIO_MODER_MODER5_SHIFT		10
#define GPIOC_GPIO_MODER_MODER5_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder5 MODER5 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOC_GPIO_MODER_MODER4_SHIFT		8
#define GPIOC_GPIO_MODER_MODER4_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder4 MODER4 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOC_GPIO_MODER_MODER3_SHIFT		6
#define GPIOC_GPIO_MODER_MODER3_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder3 MODER3 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOC_GPIO_MODER_MODER2_SHIFT		4
#define GPIOC_GPIO_MODER_MODER2_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder2 MODER2 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOC_GPIO_MODER_MODER1_SHIFT		2
#define GPIOC_GPIO_MODER_MODER1_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder1 MODER1 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOC_GPIO_MODER_MODER0_SHIFT		0
#define GPIOC_GPIO_MODER_MODER0_MASK		0x03
/** @defgroup gpioc_gpio_moder_moder0 MODER0 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioc_gpio_otyper GPIOOTYPER GPIO port output type register
@{*/

/** GPIOC_GPIO_OTYPER_OT15 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT15		(1 << 15)
/** GPIOC_GPIO_OTYPER_OT14 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT14		(1 << 14)
/** GPIOC_GPIO_OTYPER_OT13 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT13		(1 << 13)
/** GPIOC_GPIO_OTYPER_OT12 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT12		(1 << 12)
/** GPIOC_GPIO_OTYPER_OT11 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT11		(1 << 11)
/** GPIOC_GPIO_OTYPER_OT10 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT10		(1 << 10)
/** GPIOC_GPIO_OTYPER_OT9 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT9		(1 << 9)
/** GPIOC_GPIO_OTYPER_OT8 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT8		(1 << 8)
/** GPIOC_GPIO_OTYPER_OT7 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT7		(1 << 7)
/** GPIOC_GPIO_OTYPER_OT6 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT6		(1 << 6)
/** GPIOC_GPIO_OTYPER_OT5 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT5		(1 << 5)
/** GPIOC_GPIO_OTYPER_OT4 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT4		(1 << 4)
/** GPIOC_GPIO_OTYPER_OT3 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT3		(1 << 3)
/** GPIOC_GPIO_OTYPER_OT2 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT2		(1 << 2)
/** GPIOC_GPIO_OTYPER_OT1 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT1		(1 << 1)
/** GPIOC_GPIO_OTYPER_OT0 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOC_GPIO_OTYPER_OT0		(1 << 0)

/**@}*/

/** @defgroup gpioc_gpio_ospeedr GPIOOSPEEDR GPIO port output speed register
@{*/


#define GPIOC_GPIO_OSPEEDR_OSPEED15_SHIFT		30
#define GPIOC_GPIO_OSPEEDR_OSPEED15_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed15 OSPEED15 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOC_GPIO_OSPEEDR_OSPEED14_SHIFT		28
#define GPIOC_GPIO_OSPEEDR_OSPEED14_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed14 OSPEED14 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOC_GPIO_OSPEEDR_OSPEED13_SHIFT		26
#define GPIOC_GPIO_OSPEEDR_OSPEED13_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed13 OSPEED13 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOC_GPIO_OSPEEDR_OSPEED12_SHIFT		24
#define GPIOC_GPIO_OSPEEDR_OSPEED12_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed12 OSPEED12 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOC_GPIO_OSPEEDR_OSPEED11_SHIFT		22
#define GPIOC_GPIO_OSPEEDR_OSPEED11_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed11 OSPEED11 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOC_GPIO_OSPEEDR_OSPEED10_SHIFT		20
#define GPIOC_GPIO_OSPEEDR_OSPEED10_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed10 OSPEED10 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOC_GPIO_OSPEEDR_OSPEED9_SHIFT		18
#define GPIOC_GPIO_OSPEEDR_OSPEED9_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed9 OSPEED9 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOC_GPIO_OSPEEDR_OSPEED8_SHIFT		16
#define GPIOC_GPIO_OSPEEDR_OSPEED8_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed8 OSPEED8 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOC_GPIO_OSPEEDR_OSPEED7_SHIFT		14
#define GPIOC_GPIO_OSPEEDR_OSPEED7_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed7 OSPEED7 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOC_GPIO_OSPEEDR_OSPEED6_SHIFT		12
#define GPIOC_GPIO_OSPEEDR_OSPEED6_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed6 OSPEED6 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOC_GPIO_OSPEEDR_OSPEED5_SHIFT		10
#define GPIOC_GPIO_OSPEEDR_OSPEED5_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed5 OSPEED5 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOC_GPIO_OSPEEDR_OSPEED4_SHIFT		8
#define GPIOC_GPIO_OSPEEDR_OSPEED4_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed4 OSPEED4 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOC_GPIO_OSPEEDR_OSPEED3_SHIFT		6
#define GPIOC_GPIO_OSPEEDR_OSPEED3_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed3 OSPEED3 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOC_GPIO_OSPEEDR_OSPEED2_SHIFT		4
#define GPIOC_GPIO_OSPEEDR_OSPEED2_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed2 OSPEED2 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOC_GPIO_OSPEEDR_OSPEED1_SHIFT		2
#define GPIOC_GPIO_OSPEEDR_OSPEED1_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed1 OSPEED1 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOC_GPIO_OSPEEDR_OSPEED0_SHIFT		0
#define GPIOC_GPIO_OSPEEDR_OSPEED0_MASK		0x03
/** @defgroup gpioc_gpio_ospeedr_ospeed0 OSPEED0 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


/**@}*/

